# ======================
# ⭐ 基本参数（针对3.4万数据优化）
# ======================
nc: 2
depth_multiple: 0.67     # 适中（不能太大）
width_multiple: 0.50     # 控制显存

# ======================
# ⭐ Backbone（稳定+增强）
# ======================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]

  # ⭐只加一个注意力（不要太多）
  - [-1, 1, CBAM, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]

  - [-1, 1, SPPF, [1024, 5]]

# ======================
# ⭐ Head（重点优化）
# ======================
head:
  # P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]    # P3

  # ⭐关键：轻量P2（不要太重）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C2f, [128]]    # P2（降低repeat，防过拟合）

  # 回传
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  # ⭐Detect（4尺度）
  - [[18, 21, 24, 27], 1, Detect, [nc]]